app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `raffles`
WHERE `raffles`.`deleted_at` IS NULL
SELECT `id`, `slug`, `title`, `images`, `price`, `status`, `draw_date`, `percent_level`, `fake_percent_level`
FROM `raffles`
WHERE `raffles`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
---
    public function index()
    {
        $this->checkExpires();

        //echo "<pre>";
        $raffleModel = new RaffleModel();
        //echo "</pre>";
        $categoryModel = new CategoryModel();
        $winnerModel = new WinnerModel();

        $data = [
            'title' => 'Mundo Cell',
        ];

        $id_c = filter_var($this->request->getGet('c'), FILTER_SANITIZE_STRIPPED);

        if(isset($id_c) && !empty($id_c)){

            if($id_c === 'todas'){
                $data['category'] = (object) ['title' => 'Todas', 'description'=> 'Sua chance de mudar de vida'];
                $data['raffles'] = $raffleModel->select('id, slug, title, images, price, status, draw_date, percent_level, fake_percent_level, description')->asObject()->orderBy('id','DESC')->paginate(10);

SELECT `id`, `slug`, `title`, `images`, `price`, `status`, `draw_date`, `percent_level`, `fake_percent_level`
FROM `raffles`
WHERE `status` = 1
AND `raffles`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 4
SELECT *
FROM `categories`
SELECT *
FROM `winners`
WHERE `winners`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 4
---
            $qtd_raffle_home = $qtd_raffles_home[0];
            //pd($qtd_raffle_home->qtd_raffles_home);
            /* Busca direta, com limite de 4 */
            $data['raffles'] = $raffleModel->select('id, slug, title, images, price, status, draw_date, percent_level, fake_percent_level, description')->where(['status' => 1])->asObject()->orderBy('id','DESC')->findAll($qtd_raffle_home->qtd_raffles_home);
        }


        $data['categories'] = $categoryModel->findAll();

        /* Winners
        $data['winners'] = $winnerModel->orderBy('id','DESC')->findAll(4);